In [9]:
import sys
sys.path.insert(1, '../src')
import matts_work

In [10]:
df_customers, df_contracts = matts_work.load_data()
df_customers.head()

,id,company,sector,industry,email,address,city,state,zip
0,1,Bubblebox,Capital Goods,Military/Government/Technical,kyerson0@bizjournals.com,76 Randy Circle,San Diego,CA,92170
1,2,Izio,Energy,Oil & Gas Production,farlet1@comcast.net,15360 Village Green Street,Spokane,WA,99252
2,3,Twitterworks,NaN,NaN,alerohan2@ox.ac.uk,29 Hovde Hill,Milwaukee,WI,53234
3,4,Viva,Health Care,Major Pharmaceuticals,wgiovanitti3@nytimes.com,074 Center Place,Topeka,KS,66667
4,5,Jabberstorm,Technology,Computer Software: Prepackaged Software,pscallon4@fc2.com,4 Moose Way,Terre Haute,IN,47805

In [11]:
df_contracts.head()

,contract_id,customer_id,contract_start,contract_term,deposit,monthly_amt
0,1,127,8/17/2019,12,"$53,000.00","$11,600.00"
1,2,119,12/1/2019,22,"$77,000.00","$14,600.00"
2,3,160,5/1/2019,15,"$13,000.00","$22,800.00"
3,4,7,12/8/2019,23,"$56,000.00","$11,400.00"
4,5,144,2/11/2019,7,"$21,000.00","$19,800.00"

In [12]:
df = matts_work.combine_data(df_customers, df_contracts)
df.head()

,contract_id,contract_start,contract_term,deposit,monthly_amt,company,sector,industry,email,address,city,state,zip
customer_id,,,,,,,,,,,,,
1,41,5/31/2019,24,"$86,000.00","$11,200.00",Bubblebox,Capital Goods,Military/Government/Technical,kyerson0@bizjournals.com,76 Randy Circle,San Diego,CA,92170
1,358,6/18/2019,13,"$74,000.00","$19,000.00",Bubblebox,Capital Goods,Military/Government/Technical,kyerson0@bizjournals.com,76 Randy Circle,San Diego,CA,92170
1,400,8/11/2019,19,"$38,000.00","$8,800.00",Bubblebox,Capital Goods,Military/Government/Technical,kyerson0@bizjournals.com,76 Randy Circle,San Diego,CA,92170
1,424,3/13/2019,15,"$77,000.00","$14,300.00",Bubblebox,Capital Goods,Military/Government/Technical,kyerson0@bizjournals.com,76 Randy Circle,San Diego,CA,92170
1,438,10/16/2019,22,"$39,000.00","$20,000.00",Bubblebox,Capital Goods,Military/Government/Technical,kyerson0@bizjournals.com,76 Randy Circle,San Diego,CA,92170

In [13]:
df['monthly_amt'] = df['monthly_amt'].str.replace("$", "")
df['monthly_amt'] = df['monthly_amt'].str.replace(',', '').astype(float)

In [14]:
df.head()

,contract_id,contract_start,contract_term,deposit,monthly_amt,company,sector,industry,email,address,city,state,zip
customer_id,,,,,,,,,,,,,
1,41,5/31/2019,24,"$86,000.00",11200.0,Bubblebox,Capital Goods,Military/Government/Technical,kyerson0@bizjournals.com,76 Randy Circle,San Diego,CA,92170
1,358,6/18/2019,13,"$74,000.00",19000.0,Bubblebox,Capital Goods,Military/Government/Technical,kyerson0@bizjournals.com,76 Randy Circle,San Diego,CA,92170
1,400,8/11/2019,19,"$38,000.00",8800.0,Bubblebox,Capital Goods,Military/Government/Technical,kyerson0@bizjournals.com,76 Randy Circle,San Diego,CA,92170
1,424,3/13/2019,15,"$77,000.00",14300.0,Bubblebox,Capital Goods,Military/Government/Technical,kyerson0@bizjournals.com,76 Randy Circle,San Diego,CA,92170
1,438,10/16/2019,22,"$39,000.00",20000.0,Bubblebox,Capital Goods,Military/Government/Technical,kyerson0@bizjournals.com,76 Randy Circle,San Diego,CA,92170

In [15]:
df['deposit'] = df['deposit'].str.replace("$", "")
df['deposit'] = df['deposit'].str.replace(',', '').astype(float)

In [16]:
df.head()

,contract_id,contract_start,contract_term,deposit,monthly_amt,company,sector,industry,email,address,city,state,zip
customer_id,,,,,,,,,,,,,
1,41,5/31/2019,24,86000.0,11200.0,Bubblebox,Capital Goods,Military/Government/Technical,kyerson0@bizjournals.com,76 Randy Circle,San Diego,CA,92170
1,358,6/18/2019,13,74000.0,19000.0,Bubblebox,Capital Goods,Military/Government/Technical,kyerson0@bizjournals.com,76 Randy Circle,San Diego,CA,92170
1,400,8/11/2019,19,38000.0,8800.0,Bubblebox,Capital Goods,Military/Government/Technical,kyerson0@bizjournals.com,76 Randy Circle,San Diego,CA,92170
1,424,3/13/2019,15,77000.0,14300.0,Bubblebox,Capital Goods,Military/Government/Technical,kyerson0@bizjournals.com,76 Randy Circle,San Diego,CA,92170
1,438,10/16/2019,22,39000.0,20000.0,Bubblebox,Capital Goods,Military/Government/Technical,kyerson0@bizjournals.com,76 Randy Circle,San Diego,CA,92170

In [18]:
import pandas as pd

In [21]:
df['sale'] = pd.Series(df['deposit']+df['monthly_amt']*df['contract_term'])
df['sale']

customer_id
1      354800.0
1      321000.0
1      205200.0
1      291500.0
1      479000.0
         ...
200    377200.0
200     94400.0
200    236200.0
200    184500.0
200     59300.0
Name: sale, Length: 1000, dtype: float64

In [22]:
df.groupby('state').agg({'sale': 'sum'})

             sale
state
AK      2111900.0
AL      1896400.0
AR       293200.0
AZ      5670700.0
CA     22211000.0
CO      7177800.0
CT      1985300.0
DC      7297200.0
DE      3802100.0
FL     17522100.0
GA      3064200.0
ID      3768100.0
IL      4983600.0
IN      2302400.0
KS     10708400.0
KY      3007800.0
LA      8083500.0
MA      1619200.0
MD      3625700.0
ME      1385500.0
MI      4980400.0
MN      4505300.0
MO      5456800.0
MS      1407900.0
NC      5900800.0
NE      5474200.0
NV      1776000.0
NY      9627400.0
OH      7365500.0
OK      7291100.0
OR      5813700.0
PA      9068000.0
SC      1111500.0
TN      4170700.0
TX     24602200.0
VA      7899500.0
WA     13123600.0
WI      4621000.0
WV      1220300.0

In [37]:
unique_values = df['company'].unique()
unique_values

array(['Bubblebox', 'Izio', 'Twitterworks', 'Viva', 'Jabberstorm',
       'Teklist', 'Meedoo', 'Skinix', 'Thoughtbridge', 'Twitterlist',
       'Gabspot', 'Mycat', 'Leexo', 'Eamia', 'Buzzbean', 'Kwinu',
       'Plambee', 'Abatz', 'Mydeo', 'Omba', 'Tanoodle', 'Jabbercube',
       'Feedfire', 'Brainbox', 'Yadel', 'Eare', 'Midel', 'Youbridge',
       'Yodoo', 'Skyba', 'Rhyloo', 'Blogtags', 'Fivespan', 'Reallinks',
       'Vimbo', 'Innotype', 'Twimbo', 'Roodel', 'Skimia', 'Feedfish',
       'Feedspan', 'BlogXS', 'Gevee', 'Thoughtworks', 'Kazu',
       'Linkbridge', 'Yotz', 'Babblestorm', 'Devbug', 'Devpoint',
       'Brainlounge', 'Jabbertype', 'Centidel', 'JumpXS', 'Eimbee',
       'Twitternation', 'Edgepulse', 'Oyoba', 'Zoomdog', 'Bubblemix',
       'Dabfeed', 'Camimbo', 'Flipbug', 'Avamm', 'Demizz', 'Jaxworks',
       'Zoovu', 'Thoughtmix', 'Thoughtstorm', 'Photobug', 'Meetz',
       'Trilia', 'Realblab', 'Realbridge', 'Gigashots', 'Gigazoom',
       'Edgeify', 'Babbleset', 'Photojam', 'Meevee', 'Jabbersphere',
       'Photospace', 'Miboo', 'Brightbean', 'Vinder', 'Kayveo',
       'Bluezoom', 'Aivee', 'Fanoodle', 'Devify', 'Oloo', 'Linktype',
       'Realbuzz', 'Jaxbean', 'Avaveo', 'Skiptube', 'Divape', 'Flashset',
       'Camido', 'Skynoodle', 'Devcast', 'Dablist', 'Oba', 'Demivee',
       'Twinte', 'Kwimbee', 'Ooba', 'Zoonoodle', 'Skinder', 'Realcube',
       'Mudo', 'Fiveclub', 'Quinu', 'Lazz', 'Zoombox', 'Edgetag',
       'Gabvine', 'Yata', 'Zava', 'Eabox', 'Wikibox', 'Chatterbridge',
       'Dabtype', 'Youfeed', 'Twitterbeat', 'Thoughtblab', 'Centizu',
       'Wordify', 'Topicware', 'Voonder', 'Yakidoo', 'Blogspan',
       'Twitterwire', 'Eire', 'Dynabox', 'Wikivu', 'Feedbug', 'Skajo',
       'Photobean', 'Leenti', 'Zoomlounge', 'Topicshots', 'Geba',
       'Brainsphere', 'Nlounge', 'Mita', 'Cogibox', 'Voonyx', 'Realmix',
       'Tagcat', 'Roombo', 'Livefish', 'Pixope', 'Jaloo', 'Topicblab',
       'Youtags', 'Mymm', 'Meemm', 'Twitterbridge', 'Rhynyx', 'Vinte',
       'Katz'], dtype=object)

In [54]:
for company in unique_values:
    df_uniquecomp = df[df['company']==state]
    print ("Amount of Unique Companies in {} is {}".format(company, df_uniquecomp['state'].sum()))

Amount of Unique Companies in CA is 0
Amount of Unique Companies in WA is 0
Amount of Unique Companies in WI is 0
Amount of Unique Companies in KS is 0
Amount of Unique Companies in IN is 0
Amount of Unique Companies in TX is 0
Amount of Unique Companies in AR is 0
Amount of Unique Companies in DC is 0
Amount of Unique Companies in TN is 0
Amount of Unique Companies in NY is 0
Amount of Unique Companies in CO is 0
Amount of Unique Companies in MN is 0
Amount of Unique Companies in IL is 0
Amount of Unique Companies in PA is 0
Amount of Unique Companies in AZ is 0
Amount of Unique Companies in FL is 0
Amount of Unique Companies in VA is 0
Amount of Unique Companies in LA is 0
Amount of Unique Companies in OH is 0
Amount of Unique Companies in OR is 0
Amount of Unique Companies in MD is 0
Amount of Unique Companies in MI is 0
Amount of Unique Companies in NE is 0
Amount of Unique Companies in NC is 0
Amount of Unique Companies in OK is 0
Amount of Unique Companies in NV is 0
Amount of Unique Companies in GA is 0
Amount of Unique Companies in MO is 0
Amount of Unique Companies in ID is 0
Amount of Unique Companies in AK is 0
Amount of Unique Companies in WV is 0
Amount of Unique Companies in DE is 0
Amount of Unique Companies in KY is 0
Amount of Unique Companies in CT is 0
Amount of Unique Companies in ME is 0
Amount of Unique Companies in MS is 0
Amount of Unique Companies in AL is 0
Amount of Unique Companies in MA is 0
Amount of Unique Companies in SC is 0